Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresVariables Class
 The EnvironmentVariables class contains a sorted list specializing in getting active environment variables and advanced option settings. It also checks options.ini files in the active model folder as well as options_user.ini files.
Inheritance Hierarchy
System.Object
 Tekla.Structures.TeklaStructuresVariables
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class TeklaStructuresVariables
Public NotInheritable Class TeklaStructuresVariables
The TeklaStructuresVariables type exposes the following members.
Methods
Name | Description
Add
 Adds a variable to the list.
ContainsVariable
 Gets a key.
Get
 Gets a key.
Top
Fields
Name | Description
PourManagementOptionName
 The advanced option name for pour management.
Top
See Also
Reference
Tekla.Structures Namespace